Repository: winx402/blocks-mac
Catalog: apps/Blocks/BlocksSelectionHelper/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans

# selectionHelper.accessibility
source: Accessibility
ja: アクセシビリティ
zh_hans: 辅助功能

# selectionHelper.accessibility.permissionRequired
source: Permission required
ja: 権限が必要です
zh_hans: 需要辅助功能权限

# selectionHelper.accessibility.ready
source: Ready
ja: 準備完了
zh_hans: 已就绪

# selectionHelper.accessibility.request
source: Request Permission
ja: 権限を許可
zh_hans: 请求授权

# selectionHelper.connection.failed
source: Local connection failed: %@
ja: ローカル接続に失敗しました：%@
zh_hans: 本机连接失败：%@

# selectionHelper.connection.ready
source: Local connection ready
ja: ローカル接続の準備ができました
zh_hans: 本机连接已就绪

# selectionHelper.connection.starting
source: Starting local connection…
ja: ローカル接続を開始しています…
zh_hans: 正在启动本机连接…

# selectionHelper.detail
source: This helper reads only the text selection requested by Blocks. It does not access the clipboard or network.
ja: このヘルパーは Blocks が要求した選択テキストだけを読み取ります。クリップボードやネットワークにはアクセスしません。
zh_hans: 此助手只读取积木工具请求的选中文字，不访问剪贴板或网络。

# selectionHelper.launchAtLogin
source: Open at login
ja: ログイン時に開く
zh_hans: 登录时打开

# selectionHelper.pairing
source: Pairing
ja: ペアリング
zh_hans: 配对

# selectionHelper.pairing.code
source: Enter this code in Blocks
ja: このコードを Blocks に入力してください
zh_hans: 请在积木工具中输入此配对码

# selectionHelper.pairing.paired
source: Paired
ja: ペアリング済み
zh_hans: 已配对

# selectionHelper.pairing.reset
source: Reset Pairing
ja: ペアリングをリセット
zh_hans: 重置配对

# selectionHelper.pairing.reset.accessibilityHint
source: Disconnects Blocks and generates a new pairing code.
ja: Blocks とのペアリングを解除し、新しいペアリングコードを生成します。
zh_hans: 将断开与积木工具的配对，并生成新的配对码。

# selectionHelper.pairing.reset.confirmation.action
source: Reset Pairing
ja: ペアリングをリセット
zh_hans: 重置配对

# selectionHelper.pairing.reset.confirmation.cancel
source: Cancel
ja: キャンセル
zh_hans: 取消

# selectionHelper.pairing.reset.confirmation.message
source: This immediately disconnects Blocks and creates a new pairing code. It cannot be undone; pair Blocks again with the new code.
ja: Blocks との接続を直ちに解除し、新しいペアリングコードを作成します。この操作は元に戻せません。新しいコードで Blocks をもう一度ペアリングしてください。
zh_hans: 此操作会立即断开与积木工具的配对，并创建新的配对码，且无法撤销。请使用新配对码重新连接积木工具。

# selectionHelper.pairing.reset.confirmation.title
source: Reset pairing?
ja: ペアリングをリセットしますか？
zh_hans: 要重置配对吗？

# selectionHelper.pairing.reset.error
source: Pairing could not be reset. Your current pairing was kept; try again.
ja: ペアリングをリセットできませんでした。現在のペアリングは保持されています。もう一度試してください。
zh_hans: 无法重置配对，当前配对已保留。请重试。

# selectionHelper.recheck
source: Recheck
ja: 再確認
zh_hans: 重新检测

# selectionHelper.title
source: Blocks Selection Helper
ja: Blocks 選択翻訳アシスタント
zh_hans: 积木工具划词翻译助手
